$press = {
    "Маркет" => "//*[text() = 'Маркет']",
    "Электроника" => "//*[text() = 'Электроника']",
    "Мобильные телефоны" => "//*[text() = 'Мобильные телефоны']",
    "Производитель Samsung" => "//input[@name = 'Производитель Samsung']/..",
    "Цена от" => "//input[@name = 'Цена от']",
    "Название поля" => "//article[1]//h3/a",
    "Наушники и Bluetooth-гарнитуры" => "//*[text() = 'Наушники и Bluetooth-гарнитуры']",
    "Производитель Beats" => "//input[@name = 'Производитель Beats']/..",
    "Цена до" => "//input[@name = 'Цена до']"
  }